[
  {
    "skillId": 1,
    "skillName": "Beginner Guitar Lessons",
    "providerName": "Alex Martin",
    "providerEmail": "alex@skillswap.com",
    "price": 20,
    "rating": 4.8,
    "students": 1245,
    "duration": "8 hours",
    "lectures": 45,
    "level": "Beginner",
    "description": "Master the art of playing acoustic guitar from absolute zero to confident beginner! This comprehensive course is designed for complete beginners who have never touched a guitar before. You'll start with the basics - learning how to hold the guitar properly, understanding guitar anatomy, and tuning your instrument. Progress through fundamental techniques including finger positioning, basic chords (C, G, D, Em, Am), strumming patterns, and rhythm exercises. By the end of this course, you'll be able to play popular songs, understand basic music theory, read guitar tabs, and have the confidence to continue your musical journey. Each lesson includes practice exercises, downloadable chord charts, and play-along backing tracks to make learning fun and engaging.",
    "image": "https://i.ibb.co.com/K8WngXT/anita-monteiro-f-EPEFm-VLDw-M-unsplash.jpg",
    "category": "Music"
  },
  {
    "skillId": 2,
    "skillName": "Spoken English Practice",
    "providerName": "Sara Hossain",
    "providerEmail": "sara@skillswap.com",
    "price": 10,
    "rating": 4.6,
    "students": 2341,
    "duration": "6 hours",
    "lectures": 32,
    "level": "All Levels",
    "description": "Transform your English speaking skills with this dynamic conversational English course designed for non-native speakers of all levels! Whether you're a beginner struggling with basic conversations or an intermediate learner looking to sound more fluent and natural, this course has you covered. Learn essential everyday vocabulary, common phrases, and expressions used by native speakers. Master pronunciation techniques, reduce your accent, and build confidence in speaking. Practice real-world scenarios including job interviews, business meetings, casual conversations, shopping, traveling, and socializing. You'll also learn idioms, slang, and cultural nuances that make your English sound authentic. Interactive exercises include role-playing, listening comprehension, speaking drills, and peer discussions to accelerate your learning.",
    "image": "https://i.ibb.co.com/vvw1m8PC/Purple-and-White-Modern-English-Course-Facebook-Post.png",
    "category": "Language"
  },
  {
    "skillId": 3,
    "skillName": "Yoga for Beginners",
    "providerName": "Rafiq Ahmed",
    "providerEmail": "rafiq@skillswap.com",
    "price": 15,
    "rating": 4.9,
    "students": 3567,
    "duration": "10 hours",
    "lectures": 50,
    "level": "Beginner",
    "description": "Discover the transformative power of yoga with this comprehensive beginner-friendly course that combines physical practice, breathing techniques, and mindfulness meditation. Perfect for anyone new to yoga, regardless of age, fitness level, or flexibility. You'll learn foundational yoga poses (asanas) including Mountain Pose, Downward Dog, Warrior sequences, Child's Pose, and Sun Salutations. Understand proper alignment to prevent injuries and maximize benefits. Explore pranayama (breathing exercises) to reduce stress and increase energy. Practice guided meditation and relaxation techniques for mental clarity and emotional balance. Each session progresses gradually, building strength, flexibility, and body awareness. Learn how to create your own home practice routine, modify poses for your body's needs, and integrate yoga philosophy into daily life for improved physical health, mental peace, and overall well-being.",
    "image": "https://i.ibb.co.com/2YtKvp8g/Brown-Minimalist-Yoga-Class-for-Beginner-Facebook-Post.png",
    "category": "Health"
  },
  {
    "skillId": 4,
    "skillName": "Digital Marketing Basics",
    "providerName": "Lina Karim",
    "providerEmail": "lina@skillswap.com",
    "price": 25,
    "rating": 4.7,
    "students": 1876,
    "duration": "12 hours",
    "lectures": 65,
    "level": "Intermediate",
    "description": "Launch your digital marketing career or grow your business with this comprehensive course covering all essential online marketing strategies! Learn how to create effective marketing campaigns across multiple digital channels. Master Social Media Marketing on Facebook, Instagram, LinkedIn, and TikTok - including content creation, audience targeting, and engagement strategies. Understand Search Engine Optimization (SEO) to rank higher on Google and drive organic traffic. Explore paid advertising with Google Ads and Facebook Ads, including budget management and ROI tracking. Develop email marketing campaigns that convert subscribers into customers. Learn content marketing strategies, copywriting techniques, and how to build a brand online. Analyze marketing data using Google Analytics to measure performance and optimize campaigns. Real-world case studies, practical assignments, and industry best practices prepare you for immediate application in business or freelance digital marketing roles.",
    "image": "https://i.ibb.co.com/WW1s2YJP/White-And-Blue-Illustration-Basic-SEO-Techniques-Facebook-Post.png",
    "category": "Marketing"
  },
  {
    "skillId": 5,
    "skillName": "Introduction to Python",
    "providerName": "Tariq Rahman",
    "providerEmail": "tariq@skillswap.com",
    "price": 30,
    "rating": 4.8,
    "students": 4521,
    "duration": "15 hours",
    "lectures": 78,
    "level": "Beginner",
    "description": "Start your programming journey with Python, the most popular and beginner-friendly programming language used by tech giants like Google, Netflix, and NASA! This comprehensive course takes you from complete beginner to confident Python programmer. No prior coding experience required! Learn fundamental programming concepts including variables, data types, operators, conditional statements (if/else), loops (for/while), functions, and error handling. Master Python-specific features like lists, dictionaries, tuples, sets, and list comprehensions. Understand Object-Oriented Programming (OOP) principles with classes and objects. Work with files, handle exceptions, and use popular libraries like NumPy and Pandas for data manipulation. Build real-world projects including a calculator, to-do list app, web scraper, and data analysis tool. Hands-on coding exercises after each lesson reinforce learning. By course completion, you'll have a strong foundation to pursue careers in web development, data science, automation, or machine learning.",
    "image": "https://i.ibb.co.com/j9bh5SK1/python.webp",
    "category": "Programming"
  },
  {
    "skillId": 6,
    "skillName": "Photography Essentials",
    "providerName": "Maya Akter",
    "providerEmail": "maya@skillswap.com",
    "price": 20,
    "rating": 4.5,
    "students": 987,
    "duration": "9 hours",
    "lectures": 42,
    "level": "Beginner",
    "description": "Unlock your creative potential and capture stunning photographs with this complete photography course for beginners! Whether you're using a DSLR, mirrorless camera, or even a smartphone, you'll learn professional techniques to take your photography from amateur snapshots to impressive images. Master the exposure triangle (ISO, aperture, shutter speed) to control light and achieve perfect exposures in any situation. Understand composition rules including Rule of Thirds, leading lines, framing, and symmetry to create visually compelling photos. Learn how to shoot in different lighting conditions - golden hour, blue hour, harsh midday sun, and low light. Explore various photography genres including landscape, portrait, street, macro, and night photography. Discover basic photo editing techniques using free software to enhance your images. Practice assignments help you apply concepts immediately. Includes tips on choosing camera gear, understanding lenses, and building a photography portfolio to showcase your work or start a photography business.",
    "image": "https://i.ibb.co.com/0yXpm527/photography.webp",
    "category": "Art"
  },
  {
    "skillId": 7,
    "skillName": "Cooking for Beginners",
    "providerName": "Nusrat Rahman",
    "providerEmail": "nusrat@skillswap.com",
    "price": 15,
    "rating": 4.7,
    "students": 2134,
    "duration": "7 hours",
    "lectures": 38,
    "level": "Beginner",
    "description": "Learn how to cook delicious, healthy meals from scratch with this beginner-friendly cooking course! Perfect for anyone who wants to stop relying on takeout and start preparing nutritious, budget-friendly meals at home. Start with kitchen basics - essential tools, knife skills, food safety, and ingredient storage. Learn fundamental cooking techniques including boiling, sautéing, roasting, grilling, steaming, and baking. Master simple recipes for breakfast (eggs, pancakes, oatmeal), lunch (sandwiches, salads, soups), and dinner (pasta, stir-fries, chicken dishes, rice bowls). Understand flavor building with herbs, spices, and seasonings. Discover meal planning strategies to save time and money. Learn portion control, nutrition basics, and how to substitute ingredients for dietary needs. Each lesson includes step-by-step video demonstrations, ingredient lists, and cooking tips from professional chefs. Build confidence in the kitchen and impress family and friends with your newfound culinary skills!",
    "image": "https://i.ibb.co.com/Z6rzWK68/Learn-To-Cook-Beginners-Cooking-Guide-1200-1200x900-cropped.jpg",
    "category": "Lifestyle"
  },
  {
    "skillId": 8,
    "skillName": "Graphic Design with Canva",
    "providerName": "Kamal Hossain",
    "providerEmail": "kamal@skillswap.com",
    "price": 18,
    "rating": 4.6,
    "students": 3245,
    "duration": "11 hours",
    "lectures": 55,
    "level": "All Levels",
    "description": "Become a professional graphic designer using Canva, the world's most popular free design tool! This comprehensive course teaches you everything from basic design principles to creating professional-quality graphics for business and social media. No prior design experience needed! Learn fundamental design theory including color theory, typography, layout principles, visual hierarchy, and white space. Master Canva's powerful features - templates, elements, photos, fonts, effects, and brand kits. Create stunning designs for social media posts (Instagram, Facebook, LinkedIn), YouTube thumbnails, presentations, flyers, posters, business cards, resumes, ebooks, and infographics. Understand branding basics and how to maintain consistent visual identity. Learn design trends, how to work with client briefs, and tips for standing out in a crowded market. Export files in various formats for print and digital use. Perfect for entrepreneurs, marketers, small business owners, or aspiring freelance designers. Portfolio-worthy projects included to showcase your skills and attract clients!",
    "image": "https://i.ibb.co.com/0VcC53FD/800w-v52-Hl-D1-MMGc.webp",
    "category": "Design"
  },
  {
    "skillId": 9,
    "skillName": "Web Development Bootcamp",
    "providerName": "Tanvir Ahmed",
    "providerEmail": "tanvir@skillswap.com",
    "price": 45,
    "rating": 4.9,
    "students": 5678,
    "duration": "40 hours",
    "lectures": 185,
    "level": "Beginner",
    "description": "Become a full-stack web developer with this complete bootcamp covering HTML, CSS, JavaScript, React, Node.js, and MongoDB! Start from zero programming knowledge and build real-world projects. Learn HTML5 semantic tags, forms, and accessibility. Master CSS3 including Flexbox, Grid, animations, and responsive design. Dive deep into JavaScript ES6+ with functions, arrays, objects, DOM manipulation, fetch API, and async programming. Build modern web apps with React - components, hooks, state management, routing, and API integration. Create backend servers with Node.js and Express, handle authentication, and work with databases using MongoDB. Understand Git version control and deploy projects to production. Build a portfolio website, e-commerce store, social media clone, and blog platform. Learn best practices, debugging techniques, and industry-standard workflows. Career guidance included for landing your first developer job or freelance clients!",
    "image": "https://img-c.udemycdn.com/course/750x422/1565838_e54e_18.jpg",
    "category": "Programming"
  },
  {
    "skillId": 10,
    "skillName": "Data Science with Python",
    "providerName": "Dr. Mehrin Islam",
    "providerEmail": "mehrin@skillswap.com",
    "price": 50,
    "rating": 4.8,
    "students": 4123,
    "duration": "35 hours",
    "lectures": 156,
    "level": "Intermediate",
    "description": "Master data science and machine learning with Python! Perfect for analysts, developers, and anyone interested in AI/ML careers. Learn Python programming foundations, then dive into data analysis with NumPy and Pandas. Visualize data using Matplotlib, Seaborn, and Plotly. Understand statistics, probability, and hypothesis testing. Explore machine learning algorithms including Linear Regression, Logistic Regression, Decision Trees, Random Forests, K-Means Clustering, and Neural Networks. Work with real datasets from Kaggle and build predictive models. Learn data cleaning, feature engineering, model evaluation, and hyperparameter tuning. Use Scikit-learn and TensorFlow for ML projects. Understand deep learning basics and work with image/text data. Projects include house price prediction, customer segmentation, sentiment analysis, and image classification. Prepare for data science interviews with coding challenges and portfolio projects!",
    "image": "https://img-c.udemycdn.com/course/750x422/903744_8eb2.jpg",
    "category": "Programming"
  },
  {
    "skillId": 11,
    "skillName": "Piano for Beginners",
    "providerName": "Sabrina Khan",
    "providerEmail": "sabrina@skillswap.com",
    "price": 28,
    "rating": 4.7,
    "students": 1567,
    "duration": "12 hours",
    "lectures": 62,
    "level": "Beginner",
    "description": "Learn to play piano from scratch with this comprehensive beginner course! No prior music experience needed. Start with piano basics - keyboard layout, proper posture, hand positioning, and finger numbers. Learn to read music notation including treble and bass clef, note values, time signatures, and key signatures. Practice major and minor scales, chords (triads and seventh chords), and chord progressions. Master essential techniques like legato, staccato, dynamics, and pedaling. Play popular songs from classical pieces by Mozart and Beethoven to modern hits and movie themes. Understand music theory concepts like intervals, harmony, and rhythm. Develop sight-reading skills and ear training. Each lesson includes practice exercises, sheet music PDFs, and play-along tracks. Build repertoire across multiple genres - classical, pop, jazz, and blues. Tips for effective practice and overcoming common challenges included!",
    "image": "https://img-c.udemycdn.com/course/750x422/1146194_6016_3.jpg",
    "category": "Music"
  },
  {
    "skillId": 12,
    "skillName": "Business English Communication",
    "providerName": "James Wilson",
    "providerEmail": "james@skillswap.com",
    "price": 22,
    "rating": 4.6,
    "students": 2876,
    "duration": "8 hours",
    "lectures": 44,
    "level": "Intermediate",
    "description": "Master professional English communication skills for the workplace! Perfect for non-native English speakers working in international business environments. Learn business vocabulary, formal email writing, report writing, and professional correspondence. Practice making presentations, conducting meetings, negotiating, and networking in English. Understand cultural differences in business communication and international etiquette. Master telephone and video conference skills, small talk strategies, and active listening techniques. Learn how to write CVs, cover letters, and prepare for job interviews in English. Practice business scenarios including handling complaints, giving feedback, making requests, and managing conflicts professionally. Improve pronunciation and reduce accent through targeted exercises. Role-play activities simulate real workplace situations. Includes templates for emails, reports, and presentations. Boost confidence and career opportunities with clear, professional English communication!",
    "image": "https://img-c.udemycdn.com/course/750x422/394976_ce88_5.jpg",
    "category": "Language"
  },
  {
    "skillId": 13,
    "skillName": "Fitness & Strength Training",
    "providerName": "Coach Arif Hassan",
    "providerEmail": "arif@skillswap.com",
    "price": 25,
    "rating": 4.8,
    "students": 3421,
    "duration": "10 hours",
    "lectures": 48,
    "level": "All Levels",
    "description": "Transform your body and build strength with this complete fitness training program! Suitable for beginners to advanced fitness enthusiasts. Learn proper exercise form for compound movements - squats, deadlifts, bench press, overhead press, and rows. Understand progressive overload, workout splits (push/pull/legs, upper/lower), and periodization. Create personalized workout plans based on your goals - muscle building, fat loss, or general fitness. Master bodyweight exercises for home workouts and gym equipment training. Learn nutrition fundamentals including macros, calories, meal timing, and supplements. Understand recovery strategies, sleep optimization, and injury prevention. Practice mobility and flexibility exercises. Includes 12-week workout programs for different fitness levels. Track progress with measurement techniques and form check videos. Motivation strategies and habit-building tips help you stay consistent. Build the strong, healthy body you've always wanted!",
    "image": "https://img-c.udemycdn.com/course/750x422/533682_c10c_4.jpg",
    "category": "Health"
  },
  {
    "skillId": 14,
    "skillName": "Facebook Ads Mastery",
    "providerName": "Sadia Rahman",
    "providerEmail": "sadia@skillswap.com",
    "price": 35,
    "rating": 4.7,
    "students": 2543,
    "duration": "14 hours",
    "lectures": 68,
    "level": "Intermediate",
    "description": "Master Facebook and Instagram advertising to grow your business or agency! Learn to create high-converting ad campaigns that generate leads, sales, and brand awareness. Understand Facebook Ads Manager, Business Manager setup, and pixel installation. Master audience targeting including demographics, interests, behaviors, custom audiences, and lookalike audiences. Create compelling ad creatives - images, videos, carousels, and stories. Write persuasive ad copy that drives action. Learn campaign objectives, bidding strategies, and budget optimization. Understand the sales funnel - awareness, consideration, and conversion campaigns. Analyze performance metrics, split testing, and scaling successful campaigns. Explore advanced strategies like retargeting, dynamic product ads, and conversion API. Real case studies from e-commerce, service businesses, and lead generation. Avoid common mistakes and policy violations. Templates, swipe files, and tools included. Perfect for business owners, marketers, and aspiring Facebook Ads specialists!",
    "image": "https://img-c.udemycdn.com/course/750x422/1362070_b9a1_2.jpg",
    "category": "Marketing"
  },
  {
    "skillId": 15,
    "skillName": "UI/UX Design Fundamentals",
    "providerName": "Nabil Ahmed",
    "providerEmail": "nabil@skillswap.com",
    "price": 32,
    "rating": 4.9,
    "students": 1987,
    "duration": "16 hours",
    "lectures": 72,
    "level": "Beginner",
    "description": "Learn professional UI/UX design and create beautiful, user-friendly digital products! Perfect for beginners wanting to start a design career. Understand UX research methods, user personas, user journey mapping, and information architecture. Learn design thinking process and problem-solving approaches. Master UI design principles - color theory, typography, spacing, visual hierarchy, and consistency. Use Figma to create wireframes, prototypes, and high-fidelity designs. Design for mobile apps, websites, and dashboards. Learn interaction design, micro-interactions, and animation principles. Understand accessibility standards (WCAG) and inclusive design. Practice usability testing and gathering user feedback. Study real-world case studies from successful products. Create design systems and component libraries. Build a professional portfolio with 3-5 case studies. Learn how to present designs to clients and developers. Career guidance for landing UI/UX design jobs or freelance projects included!",
    "image": "https://img-c.udemycdn.com/course/750x422/2465094_de03_2.jpg",
    "category": "Design"
  },
  {
    "skillId": 16,
    "skillName": "Meditation & Mindfulness",
    "providerName": "Fatima Begum",
    "providerEmail": "fatima@skillswap.com",
    "price": 18,
    "rating": 4.8,
    "students": 4321,
    "duration": "6 hours",
    "lectures": 35,
    "level": "Beginner",
    "description": "Discover inner peace and reduce stress with this complete meditation and mindfulness course! Perfect for busy professionals, students, and anyone seeking mental clarity and emotional balance. Learn various meditation techniques including breath awareness, body scan, loving-kindness, visualization, and walking meditation. Understand mindfulness principles and how to apply them in daily life - eating, working, communicating, and dealing with emotions. Practice stress reduction techniques, anxiety management, and dealing with difficult thoughts. Learn the science behind meditation - neuroplasticity, stress response, and mental health benefits. Create a sustainable daily meditation practice with guided sessions ranging from 5 to 30 minutes. Use meditation for better sleep, focus, creativity, and relationships. Includes audio guides, meditation scripts, and tracking worksheets. No special equipment or beliefs required. Transform your mental well-being and live more peacefully in the present moment!",
    "image": "https://img-c.udemycdn.com/course/750x422/914838_d512.jpg",
    "category": "Health"
  }
]
